[
	{
		"id": "ASHG_2022",
		"type": "poster",
		"abstract": "Background: Genomic Copy Number Variants (CNVs) are associated with a range of human psychiatric and medical diseases. To understand these associations, CNVs are being investigated in increasingly large cohorts of hundreds of thousands of individuals, which include genotyping array data. Using multiple calling methods and after applying well accepted quality control (QC) criteria (Huguet et al 2018), datasets still include a significant proportion of false CNVs (~ 10%). For example, CNVs calling algorithms performed on good QC GSA Illumina arrays generate a large multigenic CNV in 2% of samples even after applying classic QC methods. Currently, these artifacts have important consequences and delay all downstream analysis. New automated quality control methods like DeepCNV are significant advances, but require large computing resources. Their scalability is problematic and often work only with one CNV caller output.\nKnowledge gap: There is currently no automated, efficient and scalable quality control algorithm that applies to multiple CNV callers. Our aim is to develop a machine learning model to discriminate true from false CNVs identified by multiple algorithms on genotyping arrays without the necessity of having access to data on probe intensity.\nMethods: We called CNVs using 2 algorithms (PennCNV and QuantiSNP) in 396,000 individuals from 8 cohorts genotyped using Affymetrix and Illumina genotyping array technologies. We manually visualized and classified as true or false approximately 35,000 CNVs (by 3 different experts). The machine learning model was trained on 70% and tested on 30% of the manually curated CNV using multiple features related to the quality of the array (CallRate, Waviness Factor, ...), as well as the characteristics of the CNVs (Probe density, likelihood score, the percentage of overlap between algorithms,  …). To balance the sample sizes of true and false CNVs, we simulated false CNVs using the “imbalanced-learn” package.\nResults: Manual curation classified 3,500 of the 35,000 CNVs as false. After training and parameter tuning, the machine learning model could predict CNV class (true vs false) with 98% accuracy. The model classified 99% of true CNVs as true and 80% of false CNVs as false. A pre-trained model can be used directly with new data instantly with no additional training. It was designed to be used with any type of array technology thanks to the feature \"Number of probes by technology\".\nConclusion: This novel tool, DigCNV, accelerates significantly the processing of large datasets and improves signal-to-noise, especially while analyzing rare non-recurrent CNVs.",
		"language": "eng",
		"title": "Random forest model to discriminate false microarray-CNVs with a 98% accuracy",
		"country":"USA",
		"congress":"American Society of Human Genetics",
		"city": "Los Angeles",
		"author": [
			{
				"family": "Renne",
				"given": "Thomas"
			},
			{
				"family": "Huguet",
				"given": "Guillaume"
			},
			{
				"family": "Douard",
				"given": "Elise"
			},
			{
				"family": "Jacquemont",
				"given": "Sébastien"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2022",
					10,
					23
				]
			]
		}
	}
]